tutorials/cases/prescribedUsCases/vortexOneOverR2/constant/reactions
species
(
    N2
);

reactions
{
}
